sergz72/ARM/mspm0g350x/ti/driverlib/dl_dma.h
/*
 * Copyright (c) 2020, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_dma.h
 *  @brief      Direct Memory Access (DMA) Driver Library
 *  @defgroup   DMA Direct Memory Access (DMA)
 *
 *  @anchor ti_dl_dl_m0p_dma_Overview
 *  # Overview
 *
 *  The Direct Memory Access (DMA) Library allows full configuration of
 *  the MSPM0 DMA module.
 *  The DMA controller transfers data from one address to another, without CPU
 *  intervention, across the entire address range.
 *  DMA controllers have multiple channels that can be configured independently
 *
 ******************************************************************************
 */
/** @addtogroup DMA
 * @{
 */
#ifndef ti_dl_dl_m0p_dma__include
#define ti_dl_dl_m0p_dma__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#ifdef __cplusplus
extern "C" {
#endif

#if (DMA_SYS_N_DMA_FULL_CHANNEL > 0)
/*!
 * @brief Device has support for DMA FULL channels
 */
#define DEVICE_HAS_DMA_FULL_CHANNEL
#endif

#ifdef DMA_SYS_MMR_LLONG
/*!
 * @brief Device has support for DMA 128-bit access on all channels
 */
#define DEVICE_HAS_LLONG_ACCESS
/*!
 * @brief If device has LLONG support, it will also support AUTO reg and GATHER mode
 */
#define DEVICE_HAS_AUTO_AND_GATHER
#endif

/* clang-format off */

/** @addtogroup DL_DMA_INTERRUPT
 *  @{
 */
/*!
 * @brief DMA channel 0 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL0                        (DMA_CPU_INT_IMASK_DMACH0_SET)

/*!
 * @brief DMA channel 1 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL1                        (DMA_CPU_INT_IMASK_DMACH1_SET)

/*!
 * @brief DMA channel 2 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL2                        (DMA_CPU_INT_IMASK_DMACH2_SET)

/*!
 * @brief DMA channel 3 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL3                        (DMA_CPU_INT_IMASK_DMACH3_SET)

/*!
 * @brief DMA channel 4 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL4                        (DMA_CPU_INT_IMASK_DMACH4_SET)

/*!
 * @brief DMA channel 5 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL5                        (DMA_CPU_INT_IMASK_DMACH5_SET)

/*!
 * @brief DMA channel 6 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL6                        (DMA_CPU_INT_IMASK_DMACH6_SET)

/*!
 * @brief DMA channel 7 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL7                        (DMA_CPU_INT_IMASK_DMACH7_SET)

/*!
 * @brief DMA channel 8 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL8                        (DMA_CPU_INT_IMASK_DMACH8_SET)

/*!
 * @brief DMA channel 9 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL9                        (DMA_CPU_INT_IMASK_DMACH9_SET)

/*!
 * @brief DMA channel 10 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL10                      (DMA_CPU_INT_IMASK_DMACH10_SET)

/*!
 * @brief DMA channel 12 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL12                      (DMA_CPU_INT_IMASK_DMACH12_SET)

/*!
 * @brief DMA channel 13 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL13                      (DMA_CPU_INT_IMASK_DMACH13_SET)

/*!
 * @brief DMA channel 14 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL14                      (DMA_CPU_INT_IMASK_DMACH14_SET)

/*!
 * @brief DMA channel 15 interrupt
 */
#define DL_DMA_INTERRUPT_CHANNEL15                      (DMA_CPU_INT_IMASK_DMACH15_SET)

#ifdef DEVICE_HAS_DMA_FULL_CHANNEL
/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 0 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_INTERRUPT_EARLY_CHANNEL0        (DMA_CPU_INT_IMASK_PREIRQCH0_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 1 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_INTERRUPT_EARLY_CHANNEL1        (DMA_CPU_INT_IMASK_PREIRQCH1_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 2 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_INTERRUPT_EARLY_CHANNEL2        (DMA_CPU_INT_IMASK_PREIRQCH2_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 3 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_INTERRUPT_EARLY_CHANNEL3        (DMA_CPU_INT_IMASK_PREIRQCH3_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 4 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_INTERRUPT_EARLY_CHANNEL4        (DMA_CPU_INT_IMASK_PREIRQCH4_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 5 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_INTERRUPT_EARLY_CHANNEL5        (DMA_CPU_INT_IMASK_PREIRQCH5_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 6 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_INTERRUPT_EARLY_CHANNEL6        (DMA_CPU_INT_IMASK_PREIRQCH6_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 7 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_INTERRUPT_EARLY_CHANNEL7        (DMA_CPU_INT_IMASK_PREIRQCH7_SET)
#endif /* DEVICE_HAS_DMA_FULL_CHANNEL */

/*!
 * @brief DMA address error, source address not reachable
 */
#define DL_DMA_INTERRUPT_ADDR_ERROR                      (DMA_CPU_INT_IMASK_ADDRERR_SET)
/*!
 * @brief DMA data error, source data might be corrupted (PAR or ECC error)
 */
#define DL_DMA_INTERRUPT_DATA_ERROR                      (DMA_CPU_INT_IMASK_DATAERR_SET)

/** @}*/

